if (!window.dictdata)
    var dictdata = {
        "state": {0: "未发布", 1: "已发布"},
        "xingbie": {1: "男", 2: "女", 3: "随意"},
        "zhuti": {"A": "吃饭", "B": "逛街", "C": "看电影", "D": "k歌", "E": "旅游"},
        "shipinzhuangtai": {"0": "待审核", "1": "审核中", "2": "审核通过", "3": "审核未通过"},
        "fenghao": {"1": " ", "2": "封号"},
        "zhuangtai": {"0": "未审核", "1": "通过", "2": "未通过"},
        "shouzhishixiang": {"1": "充值", "2": "提现", "3": "约会", "4": "平台收支"}, //1,2,3,4代表事项；
        "cengji": {"1": "市", "2": "区", "3": "商圈"},
        "yuehuizhuangtai": {"1": "成功", "2": "失败"},
        "tixianzhuangtai": {"1": "提现成功", "2": "提现失败", "3": "等待银行处理", "5": "再次提现等待处理"}
    };